validationTestCases/IBHS-GeneratedEmbers/a_windSim/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (    0     0     0)
    (30.48     0     0)
	(30.48 9.144     0)
	(    0 9.144     0)
	(    0     0 15.24)
    (30.48     0 15.24)
	(30.48 9.144 15.24)
	(    0 9.144 15.24)
);


nxBlock 100;
nyBlock  60;
nzBlock 100;

blocks
(
	hex (0 1 2 3 4 5 6 7) ($nxBlock $nyBlock $nzBlock) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	xMax
	{
		type patch;
		faces
		(
			(1 2  6 5)
		);
	}
	yMin
	{
		type patch;
		faces
		(
			(0 4 5 1)
		);
	}
	yMax
	{
		type patch;
		faces
		(
			(2 6 7 3)
		);
	}

	zMax
	{
		type patch;
		faces
		(
			(4 7 6 5)
		);
	}

	ground
	{
		type wall;
		faces
		(
			(0 1 2 3)
		);
	}
);

// ************************************************************************* //
