validationTestCases/IBHS-GeneratedEmbers/a_windSim/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cmu^0.75 * k^1.5 / L, where Cmu = 0.09, and L = 10. In my case k = 1.198854 for the entire inlet domain edge
// formula seen in Wind Around Buildings tutorial, explained here: https://cfd.direct/openfoam/user-guide/v9-cavity/#x5-340002.1.8
epsilonInlet  0.02156906538;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{

    xMin
    {
        type            fixedValue;
        value           uniform $epsilonInlet;
    }
    xMax
    {
        type            zeroGradient;
    }
    yMin
    {
        type            zeroGradient;
    }
	yMax
    {
        type            zeroGradient;
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }
    
}


// ************************************************************************* //
